
x = float(input('Введите координату X  = '))
y = float(input ('Введите координату Y  = '))

def quadrant (x,y): 
    if (x > 0) & (y > 0):
        print('Точка =>','[',x,' | ',y,'] четверть => I')
    if (x < 0) & (y > 0):
       print('Точка =>', '[',x,' | ',y,'] четверть => II')
    if (x < 0) & (y < 0):
       print('Точка =>', '[',x,' | ',y,'] четверть => III')
    if (x > 0) & (y < 0):
        print('Точка =>','[',x,' | ',y,'] четверть => IV')
    if (x == 0) & (y == 0):
        print('Точка =>','[',x,' | ',y,'] начало координат')

quadrant (x,y)

